## Terraform Plan
```hcl
00:43:40.317 WARN   The `--terragrunt-non-interactive` flag is deprecated and will be removed in a future version of Terragrunt. Use `--non-interactive` instead.
00:43:40.319 INFO   The stack at . will be processed in the following order for command plan:
Group 1
- Module .


00:43:40.346 INFO   Downloading Terraform configurations from ../.. into ./.terragrunt-cache/IYTR1OWo9cx9AWqXRHdtn6CTLTk/H9usOXzMQKcIVRafqLdmctM3Ucw
00:43:41.380 INFO   tofu: Initializing the backend...
00:43:41.959 INFO   tofu: Successfully configured the backend "s3"! OpenTofu will automatically
00:43:41.959 INFO   tofu: use this backend unless the backend configuration changes.
00:43:42.455 INFO   tofu: Initializing modules...
00:43:42.456 INFO   tofu: - dynamodb in ../dynamodb
00:43:42.457 INFO   tofu: - ec2 in ../ec2
00:43:42.458 INFO   tofu: - ecr in ../ecr
00:43:42.458 INFO   tofu: - eks in ../eks
00:43:42.507 INFO   tofu: Downloading registry.opentofu.org/terraform-aws-modules/eks/aws 19.21.0 for eks.eks...
00:43:43.514 INFO   tofu: - eks.eks in .terraform/modules/eks.eks
00:43:43.519 INFO   tofu: - eks.eks.eks_managed_node_group in .terraform/modules/eks.eks/modules/eks-managed-node-group
00:43:43.520 INFO   tofu: - eks.eks.eks_managed_node_group.user_data in .terraform/modules/eks.eks/modules/_user_data
00:43:43.521 INFO   tofu: - eks.eks.fargate_profile in .terraform/modules/eks.eks/modules/fargate-profile
00:43:43.531 INFO   tofu: Downloading registry.opentofu.org/terraform-aws-modules/kms/aws 2.1.0 for eks.eks.kms...
00:43:44.040 INFO   tofu: - eks.eks.kms in .terraform/modules/eks.eks.kms
00:43:44.047 INFO   tofu: - eks.eks.self_managed_node_group in .terraform/modules/eks.eks/modules/self-managed-node-group
00:43:44.047 INFO   tofu: - eks.eks.self_managed_node_group.user_data in .terraform/modules/eks.eks/modules/_user_data
00:43:44.048 INFO   tofu: - rds in ../rds
00:43:44.201 INFO   tofu: Downloading registry.opentofu.org/terraform-aws-modules/rds/aws 6.10.0 for rds.db...
00:43:45.239 INFO   tofu: - rds.db in .terraform/modules/rds.db
00:43:45.243 INFO   tofu: - rds.db.db_instance in .terraform/modules/rds.db/modules/db_instance
00:43:45.244 INFO   tofu: - rds.db.db_instance_role_association in .terraform/modules/rds.db/modules/db_instance_role_association
00:43:45.245 INFO   tofu: - rds.db.db_option_group in .terraform/modules/rds.db/modules/db_option_group
00:43:45.245 INFO   tofu: - rds.db.db_parameter_group in .terraform/modules/rds.db/modules/db_parameter_group
00:43:45.246 INFO   tofu: - rds.db.db_subnet_group in .terraform/modules/rds.db/modules/db_subnet_group
00:43:45.246 INFO   tofu: - redis in ../redis
00:43:45.247 INFO   tofu: - s3 in ../s3
00:43:45.247 INFO   tofu: - sqs in ../sqs
00:43:45.248 INFO   tofu: - vpc in ../vpc
00:43:45.260 INFO   tofu: Initializing provider plugins...
00:43:45.260 INFO   tofu: - Finding hashicorp/time versions matching ">= 0.9.0"...
00:43:45.421 INFO   tofu: - Finding hashicorp/cloudinit versions matching ">= 2.0.0"...
00:43:45.432 INFO   tofu: - Finding hashicorp/random versions matching ">= 3.1.0"...
00:43:45.440 INFO   tofu: - Finding hashicorp/aws versions matching ">= 4.33.0, >= 4.57.0, >= 5.0.0, >= 5.59.0, >= 5.62.0, < 6.0.0"...
00:43:45.454 INFO   tofu: - Finding hashicorp/tls versions matching ">= 3.0.0"...
00:43:45.463 INFO   tofu: - Finding hashicorp/kubernetes versions matching ">= 2.10.0"...
00:43:45.576 INFO   tofu: - Installing hashicorp/tls v4.2.1...
00:43:45.811 INFO   tofu: - Installed hashicorp/tls v4.2.1 (signed, key ID 0C0AF313E5FD9F80)
00:43:46.144 INFO   tofu: - Installing hashicorp/kubernetes v3.0.1...
00:43:46.933 INFO   tofu: - Installed hashicorp/kubernetes v3.0.1 (signed, key ID 0C0AF313E5FD9F80)
00:43:46.996 INFO   tofu: - Installing hashicorp/time v0.13.1...
00:43:47.211 INFO   tofu: - Installed hashicorp/time v0.13.1 (signed, key ID 0C0AF313E5FD9F80)
00:43:47.575 INFO   tofu: - Installing hashicorp/cloudinit v2.3.7...
00:43:47.923 INFO   tofu: - Installed hashicorp/cloudinit v2.3.7 (signed, key ID 0C0AF313E5FD9F80)
00:43:47.977 INFO   tofu: - Installing hashicorp/random v3.8.1...
00:43:48.228 INFO   tofu: - Installed hashicorp/random v3.8.1 (signed, key ID 0C0AF313E5FD9F80)
00:43:48.277 INFO   tofu: - Installing hashicorp/aws v5.100.0...
00:43:52.107 INFO   tofu: - Installed hashicorp/aws v5.100.0 (signed, key ID 0C0AF313E5FD9F80)
00:43:52.107 INFO   tofu: Providers are signed by their developers.
00:43:52.107 INFO   tofu: If you'd like to know more about provider signing, you can read about it here:
00:43:52.107 INFO   tofu: https://opentofu.org/docs/cli/plugins/signing/
00:43:52.107 INFO   tofu: OpenTofu has created a lock file .terraform.lock.hcl to record the provider
00:43:52.107 INFO   tofu: selections it made above. Include this file in your version control repository
00:43:52.107 INFO   tofu: so that OpenTofu can guarantee to make the same selections by default when
00:43:52.107 INFO   tofu: you run "tofu init" in the future.
00:43:52.107 INFO   tofu: OpenTofu has been successfully initialized!
00:43:52.107 INFO   tofu: You may now begin working with OpenTofu. Try running "tofu plan" to see
00:43:52.108 INFO   tofu: any changes that are required for your infrastructure. All OpenTofu commands
00:43:52.108 INFO   tofu: should now work.
00:43:52.108 INFO   tofu: If you ever set or change modules or backend configuration for OpenTofu,
00:43:52.108 INFO   tofu: rerun this command to reinitialize your working directory. If you forget, other
00:43:52.108 INFO   tofu: commands will detect it and remind you to do so if necessary.
00:43:52.110 INFO   Executing hook: patch_eks
Patching ./.terraform/modules/eks.eks/main.tf...
Patch applied to ./.terraform/modules/eks.eks/main.tf
00:43:56.619 STDOUT tofu: module.rds["analytics-db"].module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
00:43:56.619 STDOUT tofu: module.eks[0].module.eks.data.aws_partition.current: Reading...
00:43:56.619 STDOUT tofu: module.eks[0].data.aws_caller_identity.current: Reading...
00:43:56.619 STDOUT tofu: module.rds["flag-db"].module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
00:43:56.619 STDOUT tofu: module.rds["auth-db"].module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
00:43:56.620 STDOUT tofu: module.eks[0].module.eks.data.aws_caller_identity.current: Reading...
00:43:56.623 STDOUT tofu: module.rds["analytics-db"].module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
00:43:56.624 STDOUT tofu: module.rds["auth-db"].module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
00:43:56.625 STDOUT tofu: module.eks[0].module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
00:43:56.626 STDOUT tofu: module.rds["flag-db"].module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
00:43:56.628 STDOUT tofu: module.rds["auth-db"].module.db.module.db_instance.data.aws_partition.current: Reading...
00:43:56.629 STDOUT tofu: module.rds["analytics-db"].module.db.module.db_instance.data.aws_partition.current: Reading...
00:43:56.629 STDOUT tofu: module.rds["flag-db"].module.db.module.db_instance.data.aws_partition.current: Reading...
00:43:56.629 STDOUT tofu: module.rds["analytics-db"].module.db.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
00:43:56.629 STDOUT tofu: module.rds["auth-db"].module.db.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
00:43:56.633 STDOUT tofu: module.rds["flag-db"].module.db.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
00:43:56.693 STDOUT tofu: module.eks[0].module.eks.data.aws_caller_identity.current: Read complete after 0s [id=447941455905]
00:43:56.761 STDOUT tofu: module.eks[0].data.aws_caller_identity.current: Read complete after 0s [id=447941455905]
00:43:56.772 STDOUT tofu: module.eks[0].module.eks.module.eks_managed_node_group["toggle-master-ng"].data.aws_partition.current: Reading...
00:43:56.772 STDOUT tofu: module.eks[0].module.eks.module.eks_managed_node_group["toggle-master-ng"].data.aws_caller_identity.current: Reading...
00:43:56.773 STDOUT tofu: module.eks[0].module.eks.module.eks_managed_node_group["toggle-master-ng"].data.aws_partition.current: Read complete after 0s [id=aws]
00:43:56.844 STDOUT tofu: module.eks[0].module.eks.module.eks_managed_node_group["toggle-master-ng"].data.aws_caller_identity.current: Read complete after 0s [id=447941455905]
00:43:57.130 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
00:43:57.130 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
00:43:57.130 STDOUT tofu:   + create
00:43:57.130 STDOUT tofu:  <= read (data resources)
00:43:57.130 STDOUT tofu: OpenTofu will perform the following actions:
00:43:57.130 STDOUT tofu:   # data.aws_eks_cluster.this[0] will be read during apply
00:43:57.130 STDOUT tofu:   # (depends on a resource or a module with changes pending)
00:43:57.130 STDOUT tofu:  <= data "aws_eks_cluster" "this" {
00:43:57.130 STDOUT tofu:       + access_config             = (known after apply)
00:43:57.130 STDOUT tofu:       + arn                       = (known after apply)
00:43:57.130 STDOUT tofu:       + certificate_authority     = (known after apply)
00:43:57.130 STDOUT tofu:       + cluster_id                = (known after apply)
00:43:57.130 STDOUT tofu:       + compute_config            = (known after apply)
00:43:57.130 STDOUT tofu:       + created_at                = (known after apply)
00:43:57.130 STDOUT tofu:       + enabled_cluster_log_types = (known after apply)
00:43:57.130 STDOUT tofu:       + endpoint                  = (known after apply)
00:43:57.131 STDOUT tofu:       + id                        = (known after apply)
00:43:57.131 STDOUT tofu:       + identity                  = (known after apply)
00:43:57.131 STDOUT tofu:       + kubernetes_network_config = (known after apply)
00:43:57.131 STDOUT tofu:       + name                      = "toggle-master-eks"
00:43:57.131 STDOUT tofu:       + outpost_config            = (known after apply)
00:43:57.131 STDOUT tofu:       + platform_version          = (known after apply)
00:43:57.131 STDOUT tofu:       + remote_network_config     = (known after apply)
00:43:57.131 STDOUT tofu:       + role_arn                  = (known after apply)
00:43:57.131 STDOUT tofu:       + status                    = (known after apply)
00:43:57.131 STDOUT tofu:       + storage_config            = (known after apply)
00:43:57.131 STDOUT tofu:       + tags                      = (known after apply)
00:43:57.131 STDOUT tofu:       + upgrade_policy            = (known after apply)
00:43:57.131 STDOUT tofu:       + version                   = (known after apply)
00:43:57.131 STDOUT tofu:       + vpc_config                = (known after apply)
00:43:57.131 STDOUT tofu:       + zonal_shift_config        = (known after apply)
00:43:57.131 STDOUT tofu:     }
00:43:57.131 STDOUT tofu:   # data.aws_eks_cluster_auth.this[0] will be read during apply
00:43:57.131 STDOUT tofu:   # (depends on a resource or a module with changes pending)
00:43:57.131 STDOUT tofu:  <= data "aws_eks_cluster_auth" "this" {
00:43:57.132 STDOUT tofu:       + id    = (known after apply)
00:43:57.132 STDOUT tofu:       + name  = "toggle-master-eks"
00:43:57.132 STDOUT tofu:       + token = (sensitive value)
00:43:57.132 STDOUT tofu:     }
00:43:57.132 STDOUT tofu:   # module.dynamodb["analytics-events"].aws_dynamodb_table.this will be created
00:43:57.132 STDOUT tofu:   + resource "aws_dynamodb_table" "this" {
00:43:57.132 STDOUT tofu:       + arn              = (known after apply)
00:43:57.132 STDOUT tofu:       + billing_mode     = "PAY_PER_REQUEST"
00:43:57.132 STDOUT tofu:       + hash_key         = "event_id"
00:43:57.132 STDOUT tofu:       + id               = (known after apply)
00:43:57.132 STDOUT tofu:       + name             = "analytics_events"
00:43:57.132 STDOUT tofu:       + read_capacity    = (known after apply)
00:43:57.132 STDOUT tofu:       + stream_arn       = (known after apply)
00:43:57.132 STDOUT tofu:       + stream_label     = (known after apply)
00:43:57.132 STDOUT tofu:       + stream_view_type = (known after apply)
00:43:57.132 STDOUT tofu:       + tags             = {
00:43:57.132 STDOUT tofu:           + "Env"     = "dev"
00:43:57.132 STDOUT tofu:           + "Name"    = "analytics_events"
00:43:57.132 STDOUT tofu:           + "Project" = "toggle-master"
00:43:57.132 STDOUT tofu:         }
00:43:57.132 STDOUT tofu:       + tags_all         = {
00:43:57.132 STDOUT tofu:           + "Env"     = "dev"
00:43:57.132 STDOUT tofu:           + "Name"    = "analytics_events"
00:43:57.132 STDOUT tofu:           + "Project" = "toggle-master"
00:43:57.133 STDOUT tofu:         }
00:43:57.133 STDOUT tofu:       + write_capacity   = (known after apply)
00:43:57.133 STDOUT tofu:       + attribute {
00:43:57.133 STDOUT tofu:           + name = "event_id"
00:43:57.133 STDOUT tofu:           + type = "S"
00:43:57.133 STDOUT tofu:         }
00:43:57.133 STDOUT tofu:       + point_in_time_recovery (known after apply)
00:43:57.133 STDOUT tofu:       + server_side_encryption (known after apply)
00:43:57.133 STDOUT tofu:       + ttl (known after apply)
00:43:57.133 STDOUT tofu:     }
00:43:57.133 STDOUT tofu:   # module.ec2.aws_instance.bastion will be created
00:43:57.133 STDOUT tofu:   + resource "aws_instance" "bastion" {
00:43:57.133 STDOUT tofu:       + ami                                  = "ami-0b6c6ebed2801a5cb"
00:43:57.133 STDOUT tofu:       + arn                                  = (known after apply)
00:43:57.133 STDOUT tofu:       + associate_public_ip_address          = (known after apply)
00:43:57.133 STDOUT tofu:       + availability_zone                    = (known after apply)
00:43:57.133 STDOUT tofu:       + cpu_core_count                       = (known after apply)
00:43:57.133 STDOUT tofu:       + cpu_threads_per_core                 = (known after apply)
00:43:57.133 STDOUT tofu:       + disable_api_stop                     = (known after apply)
00:43:57.133 STDOUT tofu:       + disable_api_termination              = (known after apply)
00:43:57.133 STDOUT tofu:       + ebs_optimized                        = (known after apply)
00:43:57.134 STDOUT tofu:       + enable_primary_ipv6                  = (known after apply)
00:43:57.134 STDOUT tofu:       + get_password_data                    = false
00:43:57.134 STDOUT tofu:       + host_id                              = (known after apply)
00:43:57.134 STDOUT tofu:       + host_resource_group_arn              = (known after apply)
00:43:57.134 STDOUT tofu:       + iam_instance_profile                 = (known after apply)
00:43:57.134 STDOUT tofu:       + id                                   = (known after apply)
00:43:57.134 STDOUT tofu:       + instance_initiated_shutdown_behavior = (known after apply)
00:43:57.134 STDOUT tofu:       + instance_lifecycle                   = (known after apply)
00:43:57.134 STDOUT tofu:       + instance_state                       = (known after apply)
00:43:57.134 STDOUT tofu:       + instance_type                        = "t3.small"
00:43:57.134 STDOUT tofu:       + ipv6_address_count                   = (known after apply)
00:43:57.134 STDOUT tofu:       + ipv6_addresses                       = (known after apply)
00:43:57.135 STDOUT tofu:       + key_name                             = "iac-key"
00:43:57.135 STDOUT tofu:       + monitoring                           = (known after apply)
00:43:57.135 STDOUT tofu:       + outpost_arn                          = (known after apply)
00:43:57.135 STDOUT tofu:       + password_data                        = (known after apply)
00:43:57.135 STDOUT tofu:       + placement_group                      = (known after apply)
00:43:57.135 STDOUT tofu:       + placement_partition_number           = (known after apply)
00:43:57.135 STDOUT tofu:       + primary_network_interface_id         = (known after apply)
00:43:57.135 STDOUT tofu:       + private_dns                          = (known after apply)
00:43:57.135 STDOUT tofu:       + private_ip                           = (known after apply)
00:43:57.135 STDOUT tofu:       + public_dns                           = (known after apply)
00:43:57.135 STDOUT tofu:       + public_ip                            = (known after apply)
00:43:57.135 STDOUT tofu:       + secondary_private_ips                = (known after apply)
00:43:57.135 STDOUT tofu:       + security_groups                      = (known after apply)
00:43:57.136 STDOUT tofu:       + source_dest_check                    = true
00:43:57.136 STDOUT tofu:       + spot_instance_request_id             = (known after apply)
00:43:57.136 STDOUT tofu:       + subnet_id                            = (known after apply)
00:43:57.136 STDOUT tofu:       + tags                                 = {
00:43:57.136 STDOUT tofu:           + "Name"    = "toggle-master-dev-bastion"
00:43:57.136 STDOUT tofu:           + "Project" = "toggle-master"
00:43:57.136 STDOUT tofu:         }
00:43:57.136 STDOUT tofu:       + tags_all                             = {
00:43:57.136 STDOUT tofu:           + "Name"    = "toggle-master-dev-bastion"
00:43:57.136 STDOUT tofu:           + "Project" = "toggle-master"
00:43:57.136 STDOUT tofu:         }
00:43:57.136 STDOUT tofu:       + tenancy                              = (known after apply)
00:43:57.136 STDOUT tofu:       + user_data                            = (known after apply)
00:43:57.136 STDOUT tofu:       + user_data_base64                     = (known after apply)
00:43:57.136 STDOUT tofu:       + user_data_replace_on_change          = false
00:43:57.136 STDOUT tofu:       + vpc_security_group_ids               = (known after apply)
00:43:57.137 STDOUT tofu:       + capacity_reservation_specification (known after apply)
00:43:57.137 STDOUT tofu:       + cpu_options (known after apply)
00:43:57.137 STDOUT tofu:       + ebs_block_device (known after apply)
00:43:57.137 STDOUT tofu:       + enclave_options (known after apply)
00:43:57.137 STDOUT tofu:       + ephemeral_block_device (known after apply)
00:43:57.137 STDOUT tofu:       + instance_market_options (known after apply)
00:43:57.137 STDOUT tofu:       + maintenance_options (known after apply)
00:43:57.137 STDOUT tofu:       + metadata_options (known after apply)
00:43:57.137 STDOUT tofu:       + network_interface (known after apply)
00:43:57.137 STDOUT tofu:       + private_dns_name_options (known after apply)
00:43:57.137 STDOUT tofu:       + root_block_device (known after apply)
00:43:57.137 STDOUT tofu:     }
00:43:57.137 STDOUT tofu:   # module.ec2.aws_security_group.app_sg will be created
00:43:57.137 STDOUT tofu:   + resource "aws_security_group" "app_sg" {
00:43:57.137 STDOUT tofu:       + arn                    = (known after apply)
00:43:57.137 STDOUT tofu:       + description            = "App security group"
00:43:57.138 STDOUT tofu:       + egress                 = [
00:43:57.138 STDOUT tofu:           + {
00:43:57.138 STDOUT tofu:               + cidr_blocks      = [
00:43:57.138 STDOUT tofu:                   + "0.0.0.0/0",
00:43:57.138 STDOUT tofu:                 ]
00:43:57.138 STDOUT tofu:               + description      = ""
00:43:57.138 STDOUT tofu:               + from_port        = 0
00:43:57.138 STDOUT tofu:               + ipv6_cidr_blocks = []
00:43:57.138 STDOUT tofu:               + prefix_list_ids  = []
00:43:57.138 STDOUT tofu:               + protocol         = "-1"
00:43:57.138 STDOUT tofu:               + security_groups  = []
00:43:57.138 STDOUT tofu:               + self             = false
00:43:57.138 STDOUT tofu:               + to_port          = 0
00:43:57.138 STDOUT tofu:             },
00:43:57.138 STDOUT tofu:         ]
00:43:57.138 STDOUT tofu:       + id                     = (known after apply)
00:43:57.138 STDOUT tofu:       + ingress                = [
00:43:57.138 STDOUT tofu:           + {
00:43:57.138 STDOUT tofu:               + cidr_blocks      = [
00:43:57.138 STDOUT tofu:                   + "0.0.0.0/0",
00:43:57.138 STDOUT tofu:                 ]
00:43:57.138 STDOUT tofu:               + description      = "SSH"
00:43:57.139 STDOUT tofu:               + from_port        = 22
00:43:57.139 STDOUT tofu:               + ipv6_cidr_blocks = []
00:43:57.139 STDOUT tofu:               + prefix_list_ids  = []
00:43:57.139 STDOUT tofu:               + protocol         = "tcp"
00:43:57.139 STDOUT tofu:               + security_groups  = []
00:43:57.139 STDOUT tofu:               + self             = false
00:43:57.139 STDOUT tofu:               + to_port          = 22
00:43:57.139 STDOUT tofu:             },
00:43:57.139 STDOUT tofu:         ]
00:43:57.139 STDOUT tofu:       + name                   = "toggle-master-dev-app-sg"
00:43:57.139 STDOUT tofu:       + name_prefix            = (known after apply)
00:43:57.139 STDOUT tofu:       + owner_id               = (known after apply)
00:43:57.139 STDOUT tofu:       + revoke_rules_on_delete = false
00:43:57.139 STDOUT tofu:       + tags                   = {
00:43:57.139 STDOUT tofu:           + "Name"    = "toggle-master-dev-app-sg"
00:43:57.139 STDOUT tofu:           + "Project" = "toggle-master"
00:43:57.139 STDOUT tofu:         }
00:43:57.139 STDOUT tofu:       + tags_all               = {
00:43:57.139 STDOUT tofu:           + "Name"    = "toggle-master-dev-app-sg"
00:43:57.140 STDOUT tofu:           + "Project" = "toggle-master"
00:43:57.140 STDOUT tofu:         }
00:43:57.140 STDOUT tofu:       + vpc_id                 = (known after apply)
00:43:57.140 STDOUT tofu:     }
00:43:57.140 STDOUT tofu:   # module.ecr.aws_ecr_lifecycle_policy.this["toggle-master"] will be created
00:43:57.140 STDOUT tofu:   + resource "aws_ecr_lifecycle_policy" "this" {
00:43:57.140 STDOUT tofu:       + id          = (known after apply)
00:43:57.140 STDOUT tofu:       + policy      = jsonencode(
00:43:57.140 STDOUT tofu:             {
00:43:57.140 STDOUT tofu:               + rules = [
00:43:57.140 STDOUT tofu:                   + {
00:43:57.140 STDOUT tofu:                       + action       = {
00:43:57.140 STDOUT tofu:                           + type = "expire"
00:43:57.140 STDOUT tofu:                         }
00:43:57.140 STDOUT tofu:                       + description  = "Keep last 10 images per service tag"
00:43:57.140 STDOUT tofu:                       + rulePriority = 1
00:43:57.140 STDOUT tofu:                       + selection    = {
00:43:57.140 STDOUT tofu:                           + countNumber   = 10
00:43:57.140 STDOUT tofu:                           + countType     = "imageCountMoreThan"
00:43:57.141 STDOUT tofu:                           + tagPrefixList = [
00:43:57.141 STDOUT tofu:                               + "toggle-master",
00:43:57.141 STDOUT tofu:                             ]
00:43:57.141 STDOUT tofu:                           + tagStatus     = "tagged"
00:43:57.141 STDOUT tofu:                         }
00:43:57.141 STDOUT tofu:                     },
00:43:57.141 STDOUT tofu:                   + {
00:43:57.141 STDOUT tofu:                       + action       = {
00:43:57.141 STDOUT tofu:                           + type = "expire"
00:43:57.141 STDOUT tofu:                         }
00:43:57.141 STDOUT tofu:                       + description  = "Remove untagged images after 1 day"
00:43:57.141 STDOUT tofu:                       + rulePriority = 2
00:43:57.141 STDOUT tofu:                       + selection    = {
00:43:57.141 STDOUT tofu:                           + countNumber = 1
00:43:57.141 STDOUT tofu:                           + countType   = "sinceImagePushed"
00:43:57.141 STDOUT tofu:                           + countUnit   = "days"
00:43:57.141 STDOUT tofu:                           + tagStatus   = "untagged"
00:43:57.141 STDOUT tofu:                         }
00:43:57.141 STDOUT tofu:                     },
00:43:57.141 STDOUT tofu:                 ]
00:43:57.142 STDOUT tofu:             }
00:43:57.142 STDOUT tofu:         )
00:43:57.142 STDOUT tofu:       + registry_id = (known after apply)
00:43:57.142 STDOUT tofu:       + repository  = "toggle-master"
00:43:57.142 STDOUT tofu:     }
00:43:57.142 STDOUT tofu:   # module.ecr.aws_ecr_repository.this["toggle-master"] will be created
00:43:57.142 STDOUT tofu:   + resource "aws_ecr_repository" "this" {
00:43:57.142 STDOUT tofu:       + arn                  = (known after apply)
00:43:57.142 STDOUT tofu:       + force_delete         = true
00:43:57.142 STDOUT tofu:       + id                   = (known after apply)
00:43:57.142 STDOUT tofu:       + image_tag_mutability = "MUTABLE"
00:43:57.142 STDOUT tofu:       + name                 = "toggle-master"
00:43:57.142 STDOUT tofu:       + registry_id          = (known after apply)
00:43:57.142 STDOUT tofu:       + repository_url       = (known after apply)
00:43:57.142 STDOUT tofu:       + tags                 = {
00:43:57.142 STDOUT tofu:           + "Env"     = "dev"
00:43:57.142 STDOUT tofu:           + "Project" = "toggle-master"
00:43:57.142 STDOUT tofu:         }
00:43:57.142 STDOUT tofu:       + tags_all             = {
00:43:57.142 STDOUT tofu:           + "Env"     = "dev"
00:43:57.142 STDOUT tofu:           + "Project" = "toggle-master"
00:43:57.142 STDOUT tofu:         }
00:43:57.142 STDOUT tofu:       + image_scanning_configuration {
00:43:57.142 STDOUT tofu:           + scan_on_push = true
00:43:57.142 STDOUT tofu:         }
00:43:57.142 STDOUT tofu:     }
00:43:57.142 STDOUT tofu:   # module.eks[0].aws_security_group_rule.bastion_to_eks will be created
00:43:57.142 STDOUT tofu:   + resource "aws_security_group_rule" "bastion_to_eks" {
00:43:57.142 STDOUT tofu:       + description              = "Allow bastion to reach EKS API"
00:43:57.142 STDOUT tofu:       + from_port                = 443
00:43:57.142 STDOUT tofu:       + id                       = (known after apply)
00:43:57.143 STDOUT tofu:       + protocol                 = "tcp"
00:43:57.143 STDOUT tofu:       + security_group_id        = (known after apply)
00:43:57.143 STDOUT tofu:       + security_group_rule_id   = (known after apply)
00:43:57.143 STDOUT tofu:       + self                     = false
00:43:57.143 STDOUT tofu:       + source_security_group_id = (known after apply)
00:43:57.143 STDOUT tofu:       + to_port                  = 443
00:43:57.143 STDOUT tofu:       + type                     = "ingress"
00:43:57.143 STDOUT tofu:     }
00:43:57.143 STDOUT tofu:   # module.rds["analytics-db"].aws_security_group.allow_bastion will be created
00:43:57.143 STDOUT tofu:   + resource "aws_security_group" "allow_bastion" {
00:43:57.143 STDOUT tofu:       + arn                    = (known after apply)
00:43:57.143 STDOUT tofu:       + description            = "Acesso controlado ao RDS"
00:43:57.143 STDOUT tofu:       + egress                 = [
00:43:57.143 STDOUT tofu:           + {
00:43:57.143 STDOUT tofu:               + cidr_blocks      = [
00:43:57.143 STDOUT tofu:                   + "0.0.0.0/0",
00:43:57.143 STDOUT tofu:                 ]
00:43:57.143 STDOUT tofu:               + description      = ""
00:43:57.143 STDOUT tofu:               + from_port        = 0
00:43:57.143 STDOUT tofu:               + ipv6_cidr_blocks = []
00:43:57.143 STDOUT tofu:               + prefix_list_ids  = []
00:43:57.143 STDOUT tofu:               + protocol         = "-1"
00:43:57.143 STDOUT tofu:               + security_groups  = []
00:43:57.143 STDOUT tofu:               + self             = false
00:43:57.143 STDOUT tofu:               + to_port          = 0
00:43:57.143 STDOUT tofu:             },
00:43:57.143 STDOUT tofu:         ]
00:43:57.143 STDOUT tofu:       + id                     = (known after apply)
00:43:57.144 STDOUT tofu:       + ingress                = [
00:43:57.144 STDOUT tofu:           + {
00:43:57.144 STDOUT tofu:               + cidr_blocks      = [
00:43:57.144 STDOUT tofu:                   + "10.0.0.0/16",
00:43:57.144 STDOUT tofu:                 ]
00:43:57.144 STDOUT tofu:               + description      = "Postgres interno"
00:43:57.144 STDOUT tofu:               + from_port        = 5432
00:43:57.144 STDOUT tofu:               + ipv6_cidr_blocks = []
00:43:57.144 STDOUT tofu:               + prefix_list_ids  = []
00:43:57.144 STDOUT tofu:               + protocol         = "tcp"
00:43:57.144 STDOUT tofu:               + security_groups  = []
00:43:57.144 STDOUT tofu:               + self             = false
00:43:57.144 STDOUT tofu:               + to_port          = 5432
00:43:57.144 STDOUT tofu:             },
00:43:57.144 STDOUT tofu:         ]
00:43:57.144 STDOUT tofu:       + name                   = "toggle-master-dev-analytics-db-rds-sg"
00:43:57.144 STDOUT tofu:       + name_prefix            = (known after apply)
00:43:57.144 STDOUT tofu:       + owner_id               = (known after apply)
00:43:57.144 STDOUT tofu:       + revoke_rules_on_delete = false
00:43:57.144 STDOUT tofu:       + tags                   = {
00:43:57.144 STDOUT tofu:           + "AppOwner" = "analytics-service"
00:43:57.144 STDOUT tofu:           + "Name"     = "toggle-master-dev-rds-sg"
00:43:57.144 STDOUT tofu:           + "Project"  = "toggle-master"
00:43:57.144 STDOUT tofu:         }
00:43:57.144 STDOUT tofu:       + tags_all               = {
00:43:57.144 STDOUT tofu:           + "AppOwner" = "analytics-service"
00:43:57.144 STDOUT tofu:           + "Name"     = "toggle-master-dev-rds-sg"
00:43:57.144 STDOUT tofu:           + "Project"  = "toggle-master"
00:43:57.144 STDOUT tofu:         }
00:43:57.145 STDOUT tofu:       + vpc_id                 = (known after apply)
00:43:57.145 STDOUT tofu:     }
00:43:57.145 STDOUT tofu:   # module.rds["auth-db"].aws_security_group.allow_bastion will be created
00:43:57.145 STDOUT tofu:   + resource "aws_security_group" "allow_bastion" {
00:43:57.145 STDOUT tofu:       + arn                    = (known after apply)
00:43:57.145 STDOUT tofu:       + description            = "Acesso controlado ao RDS"
00:43:57.145 STDOUT tofu:       + egress                 = [
00:43:57.145 STDOUT tofu:           + {
00:43:57.145 STDOUT tofu:               + cidr_blocks      = [
00:43:57.145 STDOUT tofu:                   + "0.0.0.0/0",
00:43:57.145 STDOUT tofu:                 ]
00:43:57.145 STDOUT tofu:               + description      = ""
00:43:57.145 STDOUT tofu:               + from_port        = 0
00:43:57.145 STDOUT tofu:               + ipv6_cidr_blocks = []
00:43:57.145 STDOUT tofu:               + prefix_list_ids  = []
00:43:57.145 STDOUT tofu:               + protocol         = "-1"
00:43:57.145 STDOUT tofu:               + security_groups  = []
00:43:57.145 STDOUT tofu:               + self             = false
00:43:57.145 STDOUT tofu:               + to_port          = 0
00:43:57.145 STDOUT tofu:             },
00:43:57.145 STDOUT tofu:         ]
00:43:57.145 STDOUT tofu:       + id                     = (known after apply)
00:43:57.145 STDOUT tofu:       + ingress                = [
00:43:57.145 STDOUT tofu:           + {
00:43:57.145 STDOUT tofu:               + cidr_blocks      = [
00:43:57.145 STDOUT tofu:                   + "10.0.0.0/16",
00:43:57.145 STDOUT tofu:                 ]
00:43:57.145 STDOUT tofu:               + description      = "Postgres interno"
00:43:57.145 STDOUT tofu:               + from_port        = 5432
00:43:57.145 STDOUT tofu:               + ipv6_cidr_blocks = []
00:43:57.146 STDOUT tofu:               + prefix_list_ids  = []
00:43:57.146 STDOUT tofu:               + protocol         = "tcp"
00:43:57.146 STDOUT tofu:               + security_groups  = []
00:43:57.146 STDOUT tofu:               + self             = false
00:43:57.146 STDOUT tofu:               + to_port          = 5432
00:43:57.146 STDOUT tofu:             },
00:43:57.146 STDOUT tofu:         ]
00:43:57.146 STDOUT tofu:       + name                   = "toggle-master-dev-auth-db-rds-sg"
00:43:57.146 STDOUT tofu:       + name_prefix            = (known after apply)
00:43:57.146 STDOUT tofu:       + owner_id               = (known after apply)
00:43:57.146 STDOUT tofu:       + revoke_rules_on_delete = false
00:43:57.146 STDOUT tofu:       + tags                   = {
00:43:57.146 STDOUT tofu:           + "AppOwner" = "auth-service"
00:43:57.146 STDOUT tofu:           + "Name"     = "toggle-master-dev-rds-sg"
00:43:57.146 STDOUT tofu:           + "Project"  = "toggle-master"
00:43:57.146 STDOUT tofu:         }
00:43:57.146 STDOUT tofu:       + tags_all               = {
00:43:57.146 STDOUT tofu:           + "AppOwner" = "auth-service"
00:43:57.146 STDOUT tofu:           + "Name"     = "toggle-master-dev-rds-sg"
00:43:57.146 STDOUT tofu:           + "Project"  = "toggle-master"
00:43:57.146 STDOUT tofu:         }
00:43:57.146 STDOUT tofu:       + vpc_id                 = (known after apply)
00:43:57.146 STDOUT tofu:     }
00:43:57.146 STDOUT tofu:   # module.rds["flag-db"].aws_security_group.allow_bastion will be created
00:43:57.146 STDOUT tofu:   + resource "aws_security_group" "allow_bastion" {
00:43:57.146 STDOUT tofu:       + arn                    = (known after apply)
00:43:57.146 STDOUT tofu:       + description            = "Acesso controlado ao RDS"
00:43:57.147 STDOUT tofu:       + egress                 = [
00:43:57.147 STDOUT tofu:           + {
00:43:57.147 STDOUT tofu:               + cidr_blocks      = [
00:43:57.147 STDOUT tofu:                   + "0.0.0.0/0",
00:43:57.147 STDOUT tofu:                 ]
00:43:57.147 STDOUT tofu:               + description      = ""
00:43:57.147 STDOUT tofu:               + from_port        = 0
00:43:57.147 STDOUT tofu:               + ipv6_cidr_blocks = []
00:43:57.147 STDOUT tofu:               + prefix_list_ids  = []
00:43:57.147 STDOUT tofu:               + protocol         = "-1"
00:43:57.147 STDOUT tofu:               + security_groups  = []
00:43:57.147 STDOUT tofu:               + self             = false
00:43:57.147 STDOUT tofu:               + to_port          = 0
00:43:57.147 STDOUT tofu:             },
00:43:57.147 STDOUT tofu:         ]
00:43:57.147 STDOUT tofu:       + id                     = (known after apply)
00:43:57.147 STDOUT tofu:       + ingress                = [
00:43:57.147 STDOUT tofu:           + {
00:43:57.147 STDOUT tofu:               + cidr_blocks      = [
00:43:57.147 STDOUT tofu:                   + "10.0.0.0/16",
00:43:57.147 STDOUT tofu:                 ]
00:43:57.147 STDOUT tofu:               + description      = "Postgres interno"
00:43:57.147 STDOUT tofu:               + from_port        = 5432
00:43:57.148 STDOUT tofu:               + ipv6_cidr_blocks = []
00:43:57.148 STDOUT tofu:               + prefix_list_ids  = []
00:43:57.148 STDOUT tofu:               + protocol         = "tcp"
00:43:57.148 STDOUT tofu:               + security_groups  = []
00:43:57.148 STDOUT tofu:               + self             = false
00:43:57.148 STDOUT tofu:               + to_port          = 5432
00:43:57.148 STDOUT tofu:             },
00:43:57.148 STDOUT tofu:         ]
00:43:57.148 STDOUT tofu:       + name                   = "toggle-master-dev-flag-db-rds-sg"
00:43:57.148 STDOUT tofu:       + name_prefix            = (known after apply)
00:43:57.148 STDOUT tofu:       + owner_id               = (known after apply)
00:43:57.148 STDOUT tofu:       + revoke_rules_on_delete = false
00:43:57.148 STDOUT tofu:       + tags                   = {
00:43:57.148 STDOUT tofu:           + "AppOwner" = "flag-service"
00:43:57.148 STDOUT tofu:           + "Name"     = "toggle-master-dev-rds-sg"
00:43:57.148 STDOUT tofu:           + "Project"  = "toggle-master"
00:43:57.148 STDOUT tofu:         }
00:43:57.148 STDOUT tofu:       + tags_all               = {
00:43:57.148 STDOUT tofu:           + "AppOwner" = "flag-service"
00:43:57.148 STDOUT tofu:           + "Name"     = "toggle-master-dev-rds-sg"
00:43:57.148 STDOUT tofu:           + "Project"  = "toggle-master"
00:43:57.148 STDOUT tofu:         }
00:43:57.148 STDOUT tofu:       + vpc_id                 = (known after apply)
00:43:57.149 STDOUT tofu:     }
00:43:57.149 STDOUT tofu:   # module.redis["evaluation"].aws_elasticache_cluster.this will be created
00:43:57.149 STDOUT tofu:   + resource "aws_elasticache_cluster" "this" {
00:43:57.149 STDOUT tofu:       + apply_immediately          = (known after apply)
00:43:57.149 STDOUT tofu:       + arn                        = (known after apply)
00:43:57.149 STDOUT tofu:       + auto_minor_version_upgrade = "true"
00:43:57.149 STDOUT tofu:       + availability_zone          = (known after apply)
00:43:57.149 STDOUT tofu:       + az_mode                    = (known after apply)
00:43:57.149 STDOUT tofu:       + cache_nodes                = (known after apply)
00:43:57.149 STDOUT tofu:       + cluster_address            = (known after apply)
00:43:57.149 STDOUT tofu:       + cluster_id                 = "redis-evaluation"
00:43:57.149 STDOUT tofu:       + configuration_endpoint     = (known after apply)
00:43:57.149 STDOUT tofu:       + engine                     = "redis"
00:43:57.149 STDOUT tofu:       + engine_version             = "7.0"
00:43:57.149 STDOUT tofu:       + engine_version_actual      = (known after apply)
00:43:57.149 STDOUT tofu:       + id                         = (known after apply)
00:43:57.149 STDOUT tofu:       + ip_discovery               = (known after apply)
00:43:57.149 STDOUT tofu:       + maintenance_window         = (known after apply)
00:43:57.149 STDOUT tofu:       + network_type               = (known after apply)
00:43:57.149 STDOUT tofu:       + node_type                  = "cache.t3.micro"
00:43:57.149 STDOUT tofu:       + num_cache_nodes            = 1
00:43:57.149 STDOUT tofu:       + parameter_group_name       = (known after apply)
00:43:57.150 STDOUT tofu:       + port                       = 6379
00:43:57.150 STDOUT tofu:       + preferred_outpost_arn      = (known after apply)
00:43:57.150 STDOUT tofu:       + replication_group_id       = (known after apply)
00:43:57.150 STDOUT tofu:       + security_group_ids         = (known after apply)
00:43:57.150 STDOUT tofu:       + snapshot_window            = (known after apply)
00:43:57.150 STDOUT tofu:       + subnet_group_name          = "redis-evaluation-subnet-group"
00:43:57.150 STDOUT tofu:       + tags                       = {
00:43:57.150 STDOUT tofu:           + "Env"     = "dev"
00:43:57.150 STDOUT tofu:           + "Name"    = "redis-evaluation"
00:43:57.150 STDOUT tofu:           + "Project" = "toggle-master"
00:43:57.150 STDOUT tofu:         }
00:43:57.150 STDOUT tofu:       + tags_all                   = {
00:43:57.150 STDOUT tofu:           + "Env"     = "dev"
00:43:57.150 STDOUT tofu:           + "Name"    = "redis-evaluation"
00:43:57.150 STDOUT tofu:           + "Project" = "toggle-master"
00:43:57.150 STDOUT tofu:         }
00:43:57.150 STDOUT tofu:       + transit_encryption_enabled = (known after apply)
00:43:57.150 STDOUT tofu:     }
00:43:57.150 STDOUT tofu:   # module.redis["evaluation"].aws_elasticache_subnet_group.this will be created
00:43:57.150 STDOUT tofu:   + resource "aws_elasticache_subnet_group" "this" {
00:43:57.150 STDOUT tofu:       + arn         = (known after apply)
00:43:57.150 STDOUT tofu:       + description = "Managed by Terraform"
00:43:57.151 STDOUT tofu:       + id          = (known after apply)
00:43:57.151 STDOUT tofu:       + name        = "redis-evaluation-subnet-group"
00:43:57.151 STDOUT tofu:       + subnet_ids  = (known after apply)
00:43:57.151 STDOUT tofu:       + tags        = {
00:43:57.151 STDOUT tofu:           + "Env"     = "dev"
00:43:57.151 STDOUT tofu:           + "Name"    = "redis-evaluation-subnet-group"
00:43:57.151 STDOUT tofu:           + "Project" = "toggle-master"
00:43:57.151 STDOUT tofu:         }
00:43:57.151 STDOUT tofu:       + tags_all    = {
00:43:57.151 STDOUT tofu:           + "Env"     = "dev"
00:43:57.151 STDOUT tofu:           + "Name"    = "redis-evaluation-subnet-group"
00:43:57.151 STDOUT tofu:           + "Project" = "toggle-master"
00:43:57.151 STDOUT tofu:         }
00:43:57.151 STDOUT tofu:       + vpc_id      = (known after apply)
00:43:57.151 STDOUT tofu:     }
00:43:57.151 STDOUT tofu:   # module.redis["evaluation"].aws_security_group.this will be created
00:43:57.151 STDOUT tofu:   + resource "aws_security_group" "this" {
00:43:57.151 STDOUT tofu:       + arn                    = (known after apply)
00:43:57.151 STDOUT tofu:       + description            = "Security group for Redis redis-evaluation"
00:43:57.151 STDOUT tofu:       + egress                 = [
00:43:57.151 STDOUT tofu:           + {
00:43:57.151 STDOUT tofu:               + cidr_blocks      = [
00:43:57.152 STDOUT tofu:                   + "0.0.0.0/0",
00:43:57.152 STDOUT tofu:                 ]
00:43:57.152 STDOUT tofu:               + description      = ""
00:43:57.152 STDOUT tofu:               + from_port        = 0
00:43:57.152 STDOUT tofu:               + ipv6_cidr_blocks = []
00:43:57.152 STDOUT tofu:               + prefix_list_ids  = []
00:43:57.152 STDOUT tofu:               + protocol         = "-1"
00:43:57.152 STDOUT tofu:               + security_groups  = []
00:43:57.152 STDOUT tofu:               + self             = false
00:43:57.152 STDOUT tofu:               + to_port          = 0
00:43:57.152 STDOUT tofu:             },
00:43:57.152 STDOUT tofu:         ]
00:43:57.152 STDOUT tofu:       + id                     = (known after apply)
00:43:57.152 STDOUT tofu:       + ingress                = [
00:43:57.152 STDOUT tofu:           + {
00:43:57.152 STDOUT tofu:               + cidr_blocks      = [
00:43:57.152 STDOUT tofu:                   + "10.0.0.0/16",
00:43:57.152 STDOUT tofu:                 ]
00:43:57.152 STDOUT tofu:               + description      = ""
00:43:57.152 STDOUT tofu:               + from_port        = 6379
00:43:57.152 STDOUT tofu:               + ipv6_cidr_blocks = []
00:43:57.153 STDOUT tofu:               + prefix_list_ids  = []
00:43:57.153 STDOUT tofu:               + protocol         = "tcp"
00:43:57.153 STDOUT tofu:               + security_groups  = []
00:43:57.153 STDOUT tofu:               + self             = false
00:43:57.153 STDOUT tofu:               + to_port          = 6379
00:43:57.153 STDOUT tofu:             },
00:43:57.153 STDOUT tofu:         ]
00:43:57.153 STDOUT tofu:       + name                   = "toggle-master-dev-redis-evaluation-sg"
00:43:57.153 STDOUT tofu:       + name_prefix            = (known after apply)
00:43:57.153 STDOUT tofu:       + owner_id               = (known after apply)
00:43:57.153 STDOUT tofu:       + revoke_rules_on_delete = false
00:43:57.153 STDOUT tofu:       + tags                   = {
00:43:57.153 STDOUT tofu:           + "Env"     = "dev"
00:43:57.153 STDOUT tofu:           + "Name"    = "toggle-master-dev-redis-evaluation-sg"
00:43:57.153 STDOUT tofu:           + "Project" = "toggle-master"
00:43:57.153 STDOUT tofu:         }
00:43:57.153 STDOUT tofu:       + tags_all               = {
00:43:57.153 STDOUT tofu:           + "Env"     = "dev"
00:43:57.153 STDOUT tofu:           + "Name"    = "toggle-master-dev-redis-evaluation-sg"
00:43:57.153 STDOUT tofu:           + "Project" = "toggle-master"
00:43:57.153 STDOUT tofu:         }
00:43:57.153 STDOUT tofu:       + vpc_id                 = (known after apply)
00:43:57.153 STDOUT tofu:     }
00:43:57.153 STDOUT tofu:   # module.s3.aws_s3_bucket.state will be created
00:43:57.153 STDOUT tofu:   + resource "aws_s3_bucket" "state" {
00:43:57.154 STDOUT tofu:       + acceleration_status         = (known after apply)
00:43:57.154 STDOUT tofu:       + acl                         = (known after apply)
00:43:57.154 STDOUT tofu:       + arn                         = (known after apply)
00:43:57.154 STDOUT tofu:       + bucket                      = "toggle-master-dev-app"
00:43:57.154 STDOUT tofu:       + bucket_domain_name          = (known after apply)
00:43:57.154 STDOUT tofu:       + bucket_prefix               = (known after apply)
00:43:57.154 STDOUT tofu:       + bucket_regional_domain_name = (known after apply)
00:43:57.154 STDOUT tofu:       + force_destroy               = true
00:43:57.154 STDOUT tofu:       + hosted_zone_id              = (known after apply)
00:43:57.154 STDOUT tofu:       + id                          = (known after apply)
00:43:57.154 STDOUT tofu:       + object_lock_enabled         = (known after apply)
00:43:57.154 STDOUT tofu:       + policy                      = (known after apply)
00:43:57.154 STDOUT tofu:       + region                      = (known after apply)
00:43:57.154 STDOUT tofu:       + request_payer               = (known after apply)
00:43:57.154 STDOUT tofu:       + tags                        = {
00:43:57.154 STDOUT tofu:           + "Name"    = "toggle-master-dev-app"
00:43:57.154 STDOUT tofu:           + "Project" = "toggle-master"
00:43:57.154 STDOUT tofu:         }
00:43:57.154 STDOUT tofu:       + tags_all                    = {
00:43:57.154 STDOUT tofu:           + "Name"    = "toggle-master-dev-app"
00:43:57.154 STDOUT tofu:           + "Project" = "toggle-master"
00:43:57.154 STDOUT tofu:         }
00:43:57.154 STDOUT tofu:       + website_domain              = (known after apply)
00:43:57.154 STDOUT tofu:       + website_endpoint            = (known after apply)
00:43:57.154 STDOUT tofu:       + cors_rule (known after apply)
00:43:57.154 STDOUT tofu:       + grant (known after apply)
00:43:57.155 STDOUT tofu:       + lifecycle_rule (known after apply)
00:43:57.155 STDOUT tofu:       + logging (known after apply)
00:43:57.155 STDOUT tofu:       + object_lock_configuration (known after apply)
00:43:57.155 STDOUT tofu:       + replication_configuration (known after apply)
00:43:57.155 STDOUT tofu:       + server_side_encryption_configuration (known after apply)
00:43:57.155 STDOUT tofu:       + versioning (known after apply)
00:43:57.155 STDOUT tofu:       + website (known after apply)
00:43:57.155 STDOUT tofu:     }
00:43:57.155 STDOUT tofu:   # module.s3.aws_s3_bucket_server_side_encryption_configuration.state_encryption will be created
00:43:57.155 STDOUT tofu:   + resource "aws_s3_bucket_server_side_encryption_configuration" "state_encryption" {
00:43:57.155 STDOUT tofu:       + bucket = (known after apply)
00:43:57.155 STDOUT tofu:       + id     = (known after apply)
00:43:57.155 STDOUT tofu:       + rule {
00:43:57.155 STDOUT tofu:           + apply_server_side_encryption_by_default {
00:43:57.155 STDOUT tofu:               + sse_algorithm = "AES256"
00:43:57.155 STDOUT tofu:             }
00:43:57.155 STDOUT tofu:         }
00:43:57.155 STDOUT tofu:     }
00:43:57.155 STDOUT tofu:   # module.s3.aws_s3_bucket_versioning.state_ver will be created
00:43:57.155 STDOUT tofu:   + resource "aws_s3_bucket_versioning" "state_ver" {
00:43:57.155 STDOUT tofu:       + bucket = (known after apply)
00:43:57.155 STDOUT tofu:       + id     = (known after apply)
00:43:57.155 STDOUT tofu:       + versioning_configuration {
00:43:57.155 STDOUT tofu:           + mfa_delete = (known after apply)
00:43:57.155 STDOUT tofu:           + status     = "Enabled"
00:43:57.155 STDOUT tofu:         }
00:43:57.155 STDOUT tofu:     }
00:43:57.155 STDOUT tofu:   # module.sqs["analytics"].aws_sqs_queue.dlq[0] will be created
00:43:57.155 STDOUT tofu:   + resource "aws_sqs_queue" "dlq" {
00:43:57.155 STDOUT tofu:       + arn                               = (known after apply)
00:43:57.155 STDOUT tofu:       + content_based_deduplication       = false
00:43:57.155 STDOUT tofu:       + deduplication_scope               = (known after apply)
00:43:57.155 STDOUT tofu:       + delay_seconds                     = 0
00:43:57.155 STDOUT tofu:       + fifo_queue                        = false
00:43:57.155 STDOUT tofu:       + fifo_throughput_limit             = (known after apply)
00:43:57.156 STDOUT tofu:       + id                                = (known after apply)
00:43:57.156 STDOUT tofu:       + kms_data_key_reuse_period_seconds = (known after apply)
00:43:57.156 STDOUT tofu:       + max_message_size                  = 262144
00:43:57.156 STDOUT tofu:       + message_retention_seconds         = 1209600
00:43:57.156 STDOUT tofu:       + name                              = "toggle-analytics-queue-dlq"
00:43:57.156 STDOUT tofu:       + name_prefix                       = (known after apply)
00:43:57.156 STDOUT tofu:       + policy                            = (known after apply)
00:43:57.156 STDOUT tofu:       + receive_wait_time_seconds         = 0
00:43:57.156 STDOUT tofu:       + redrive_allow_policy              = (known after apply)
00:43:57.156 STDOUT tofu:       + redrive_policy                    = (known after apply)
00:43:57.156 STDOUT tofu:       + sqs_managed_sse_enabled           = (known after apply)
00:43:57.156 STDOUT tofu:       + tags                              = {
00:43:57.156 STDOUT tofu:           + "Env"     = "dev"
00:43:57.156 STDOUT tofu:           + "Name"    = "toggle-analytics-queue-dlq"
00:43:57.156 STDOUT tofu:           + "Project" = "toggle-master"
00:43:57.156 STDOUT tofu:         }
00:43:57.156 STDOUT tofu:       + tags_all                          = {
00:43:57.156 STDOUT tofu:           + "Env"     = "dev"
00:43:57.156 STDOUT tofu:           + "Name"    = "toggle-analytics-queue-dlq"
00:43:57.156 STDOUT tofu:           + "Project" = "toggle-master"
00:43:57.156 STDOUT tofu:         }
00:43:57.156 STDOUT tofu:       + url                               = (known after apply)
00:43:57.156 STDOUT tofu:       + visibility_timeout_seconds        = 30
00:43:57.156 STDOUT tofu:     }
00:43:57.156 STDOUT tofu:   # module.sqs["analytics"].aws_sqs_queue.this will be created
00:43:57.156 STDOUT tofu:   + resource "aws_sqs_queue" "this" {
00:43:57.157 STDOUT tofu:       + arn                               = (known after apply)
00:43:57.157 STDOUT tofu:       + content_based_deduplication       = false
00:43:57.157 STDOUT tofu:       + deduplication_scope               = (known after apply)
00:43:57.157 STDOUT tofu:       + delay_seconds                     = 0
00:43:57.157 STDOUT tofu:       + fifo_queue                        = false
00:43:57.157 STDOUT tofu:       + fifo_throughput_limit             = (known after apply)
00:43:57.157 STDOUT tofu:       + id                                = (known after apply)
00:43:57.157 STDOUT tofu:       + kms_data_key_reuse_period_seconds = (known after apply)
00:43:57.157 STDOUT tofu:       + max_message_size                  = 262144
00:43:57.157 STDOUT tofu:       + message_retention_seconds         = 86400
00:43:57.157 STDOUT tofu:       + name                              = "toggle-analytics-queue"
00:43:57.157 STDOUT tofu:       + name_prefix                       = (known after apply)
00:43:57.157 STDOUT tofu:       + policy                            = (known after apply)
00:43:57.157 STDOUT tofu:       + receive_wait_time_seconds         = 0
00:43:57.157 STDOUT tofu:       + redrive_allow_policy              = (known after apply)
00:43:57.157 STDOUT tofu:       + redrive_policy                    = (known after apply)
00:43:57.157 STDOUT tofu:       + sqs_managed_sse_enabled           = (known after apply)
00:43:57.157 STDOUT tofu:       + tags                              = {
00:43:57.157 STDOUT tofu:           + "Env"     = "dev"
00:43:57.158 STDOUT tofu:           + "Name"    = "toggle-analytics-queue"
00:43:57.158 STDOUT tofu:           + "Project" = "toggle-master"
00:43:57.158 STDOUT tofu:         }
00:43:57.158 STDOUT tofu:       + tags_all                          = {
00:43:57.158 STDOUT tofu:           + "Env"     = "dev"
00:43:57.158 STDOUT tofu:           + "Name"    = "toggle-analytics-queue"
00:43:57.158 STDOUT tofu:           + "Project" = "toggle-master"
00:43:57.158 STDOUT tofu:         }
00:43:57.158 STDOUT tofu:       + url                               = (known after apply)
00:43:57.158 STDOUT tofu:       + visibility_timeout_seconds        = 30
00:43:57.158 STDOUT tofu:     }
00:43:57.158 STDOUT tofu:   # module.vpc.aws_eip.nat_eip will be created
00:43:57.158 STDOUT tofu:   + resource "aws_eip" "nat_eip" {
00:43:57.158 STDOUT tofu:       + allocation_id        = (known after apply)
00:43:57.158 STDOUT tofu:       + arn                  = (known after apply)
00:43:57.158 STDOUT tofu:       + association_id       = (known after apply)
00:43:57.158 STDOUT tofu:       + carrier_ip           = (known after apply)
00:43:57.158 STDOUT tofu:       + customer_owned_ip    = (known after apply)
00:43:57.158 STDOUT tofu:       + domain               = "vpc"
00:43:57.158 STDOUT tofu:       + id                   = (known after apply)
00:43:57.158 STDOUT tofu:       + instance             = (known after apply)
00:43:57.158 STDOUT tofu:       + ipam_pool_id         = (known after apply)
00:43:57.158 STDOUT tofu:       + network_border_group = (known after apply)
00:43:57.158 STDOUT tofu:       + network_interface    = (known after apply)
00:43:57.159 STDOUT tofu:       + private_dns          = (known after apply)
00:43:57.159 STDOUT tofu:       + private_ip           = (known after apply)
00:43:57.159 STDOUT tofu:       + ptr_record           = (known after apply)
00:43:57.159 STDOUT tofu:       + public_dns           = (known after apply)
00:43:57.159 STDOUT tofu:       + public_ip            = (known after apply)
00:43:57.159 STDOUT tofu:       + public_ipv4_pool     = (known after apply)
00:43:57.159 STDOUT tofu:       + tags                 = {
00:43:57.159 STDOUT tofu:           + "Name"    = "toggle-master-dev-nat-eip"
00:43:57.159 STDOUT tofu:           + "Project" = "toggle-master"
00:43:57.159 STDOUT tofu:         }
00:43:57.159 STDOUT tofu:       + tags_all             = {
00:43:57.159 STDOUT tofu:           + "Name"    = "toggle-master-dev-nat-eip"
00:43:57.159 STDOUT tofu:           + "Project" = "toggle-master"
00:43:57.159 STDOUT tofu:         }
00:43:57.159 STDOUT tofu:       + vpc                  = (known after apply)
00:43:57.159 STDOUT tofu:     }
00:43:57.159 STDOUT tofu:   # module.vpc.aws_internet_gateway.igw will be created
00:43:57.159 STDOUT tofu:   + resource "aws_internet_gateway" "igw" {
00:43:57.159 STDOUT tofu:       + arn      = (known after apply)
00:43:57.159 STDOUT tofu:       + id       = (known after apply)
00:43:57.159 STDOUT tofu:       + owner_id = (known after apply)
00:43:57.159 STDOUT tofu:       + tags     = {
00:43:57.159 STDOUT tofu:           + "Name"    = "toggle-master-dev-igw"
00:43:57.159 STDOUT tofu:           + "Project" = "toggle-master"
00:43:57.159 STDOUT tofu:         }
00:43:57.159 STDOUT tofu:       + tags_all = {
00:43:57.159 STDOUT tofu:           + "Name"    = "toggle-master-dev-igw"
00:43:57.159 STDOUT tofu:           + "Project" = "toggle-master"
00:43:57.160 STDOUT tofu:         }
00:43:57.160 STDOUT tofu:       + vpc_id   = (known after apply)
00:43:57.160 STDOUT tofu:     }
00:43:57.160 STDOUT tofu:   # module.vpc.aws_nat_gateway.nat will be created
00:43:57.160 STDOUT tofu:   + resource "aws_nat_gateway" "nat" {
00:43:57.160 STDOUT tofu:       + allocation_id                      = (known after apply)
00:43:57.160 STDOUT tofu:       + association_id                     = (known after apply)
00:43:57.160 STDOUT tofu:       + connectivity_type                  = "public"
00:43:57.160 STDOUT tofu:       + id                                 = (known after apply)
00:43:57.160 STDOUT tofu:       + network_interface_id               = (known after apply)
00:43:57.160 STDOUT tofu:       + private_ip                         = (known after apply)
00:43:57.160 STDOUT tofu:       + public_ip                          = (known after apply)
00:43:57.160 STDOUT tofu:       + secondary_private_ip_address_count = (known after apply)
00:43:57.160 STDOUT tofu:       + secondary_private_ip_addresses     = (known after apply)
00:43:57.160 STDOUT tofu:       + subnet_id                          = (known after apply)
00:43:57.160 STDOUT tofu:       + tags                               = {
00:43:57.160 STDOUT tofu:           + "Name"    = "toggle-master-dev-nat"
00:43:57.160 STDOUT tofu:           + "Project" = "toggle-master"
00:43:57.160 STDOUT tofu:         }
00:43:57.160 STDOUT tofu:       + tags_all                           = {
00:43:57.160 STDOUT tofu:           + "Name"    = "toggle-master-dev-nat"
00:43:57.160 STDOUT tofu:           + "Project" = "toggle-master"
00:43:57.161 STDOUT tofu:         }
00:43:57.161 STDOUT tofu:     }
00:43:57.161 STDOUT tofu:   # module.vpc.aws_route_table.private will be created
00:43:57.161 STDOUT tofu:   + resource "aws_route_table" "private" {
00:43:57.161 STDOUT tofu:       + arn              = (known after apply)
00:43:57.161 STDOUT tofu:       + id               = (known after apply)
00:43:57.161 STDOUT tofu:       + owner_id         = (known after apply)
00:43:57.161 STDOUT tofu:       + propagating_vgws = (known after apply)
00:43:57.161 STDOUT tofu:       + route            = [
00:43:57.161 STDOUT tofu:           + {
00:43:57.161 STDOUT tofu:               + carrier_gateway_id         = ""
00:43:57.161 STDOUT tofu:               + cidr_block                 = "0.0.0.0/0"
00:43:57.161 STDOUT tofu:               + core_network_arn           = ""
00:43:57.161 STDOUT tofu:               + destination_prefix_list_id = ""
00:43:57.161 STDOUT tofu:               + egress_only_gateway_id     = ""
00:43:57.161 STDOUT tofu:               + gateway_id                 = ""
00:43:57.161 STDOUT tofu:               + ipv6_cidr_block            = ""
00:43:57.161 STDOUT tofu:               + local_gateway_id           = ""
00:43:57.161 STDOUT tofu:               + nat_gateway_id             = (known after apply)
00:43:57.161 STDOUT tofu:               + network_interface_id       = ""
00:43:57.161 STDOUT tofu:               + transit_gateway_id         = ""
00:43:57.161 STDOUT tofu:               + vpc_endpoint_id            = ""
00:43:57.161 STDOUT tofu:               + vpc_peering_connection_id  = ""
00:43:57.161 STDOUT tofu:             },
00:43:57.161 STDOUT tofu:         ]
00:43:57.161 STDOUT tofu:       + tags             = {
00:43:57.161 STDOUT tofu:           + "Name"    = "toggle-master-dev-private-rt"
00:43:57.162 STDOUT tofu:           + "Project" = "toggle-master"
00:43:57.162 STDOUT tofu:         }
00:43:57.162 STDOUT tofu:       + tags_all         = {
00:43:57.162 STDOUT tofu:           + "Name"    = "toggle-master-dev-private-rt"
00:43:57.162 STDOUT tofu:           + "Project" = "toggle-master"
00:43:57.162 STDOUT tofu:         }
00:43:57.162 STDOUT tofu:       + vpc_id           = (known after apply)
00:43:57.162 STDOUT tofu:     }
00:43:57.162 STDOUT tofu:   # module.vpc.aws_route_table.public will be created
00:43:57.162 STDOUT tofu:   + resource "aws_route_table" "public" {
00:43:57.162 STDOUT tofu:       + arn              = (known after apply)
00:43:57.162 STDOUT tofu:       + id               = (known after apply)
00:43:57.162 STDOUT tofu:       + owner_id         = (known after apply)
00:43:57.162 STDOUT tofu:       + propagating_vgws = (known after apply)
00:43:57.162 STDOUT tofu:       + route            = [
00:43:57.162 STDOUT tofu:           + {
00:43:57.162 STDOUT tofu:               + carrier_gateway_id         = ""
00:43:57.162 STDOUT tofu:               + cidr_block                 = "0.0.0.0/0"
00:43:57.162 STDOUT tofu:               + core_network_arn           = ""
00:43:57.162 STDOUT tofu:               + destination_prefix_list_id = ""
00:43:57.162 STDOUT tofu:               + egress_only_gateway_id     = ""
00:43:57.162 STDOUT tofu:               + gateway_id  

... (truncado)
```